[Killed] BooleanLiteral
src/api/server.ts:14:13
  */
 export async function createServer(): Promise<FastifyInstance> {
   const app = Fastify({ 
-    logger: true,
+    logger: false,
     genReqId: () => `req_${Date.now()}_${Math.random().toString(36).substring(2, 11)}`,
   });
killedBy: Server instrumentation telemetry Given createServer | When generates prefixed request ids | Then Fastify genReqId emits req_<timestamp>_<random> format
statusReason: expected undefined to be 'info' // Object.is equality

[Killed] ArrowFunction
src/api/server.ts:15:15
 export async function createServer(): Promise<FastifyInstance> {
   const app = Fastify({ 
     logger: true,
-    genReqId: () => `req_${Date.now()}_${Math.random().toString(36).substring(2, 11)}`,
+    genReqId: () => undefined,
   });
 
killedBy: Server instrumentation telemetry Given createServer | When generates prefixed request ids | Then Fastify genReqId emits req_<timestamp>_<random> format
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] MethodExpression
src/api/server.ts:15:42
 export async function createServer(): Promise<FastifyInstance> {
   const app = Fastify({ 
     logger: true,
-    genReqId: () => `req_${Date.now()}_${Math.random().toString(36).substring(2, 11)}`,
+    genReqId: () => `req_${Date.now()}_${Math.random().toString(36)}`,
   });
 
killedBy: Server instrumentation telemetry Given createServer | When generates prefixed request ids | Then Fastify genReqId emits req_<timestamp>_<random> format
statusReason: expected 'req_1771208759538_0.23pm1b06lri' to match /^req_\d{13}_[a-z0-9]{9}$/

[Killed] StringLiteral
src/api/server.ts:18:34
     genReqId: () => `req_${Date.now()}_${Math.random().toString(36).substring(2, 11)}`,
   });
 
-  const tracer = trace.getTracer('ae-framework-api');
+  const tracer = trace.getTracer("");
 
   // Register security headers middleware with development config for testing
killedBy: Server instrumentation telemetry Given request tracing | When handles successful response | Then records tracing attributes and counters
statusReason: expected "spy" to be called with arguments: [ 'ae-framework-api' ]

Received: 

  1st spy call:

  Array [
-   "ae-framework-api",

[Killed] EqualityOperator
src/api/server.ts:21:26
   const tracer = trace.getTracer('ae-framework-api');
 
   // Register security headers middleware with development config for testing
-  const securityConfig = process.env['NODE_ENV'] === 'test' 
+  const securityConfig = process.env['NODE_ENV'] !== 'test' 
     ? {
         enabled: true,
killedBy: Server instrumentation telemetry Given security headers (test) | When returns hardened defaults | Then enforces CSP and strips server signatures in test mode
statusReason: expected undefined to be 'default-src \'self\'; script-src \'se…' // Object.is equality

[Killed] ConditionalExpression
src/api/server.ts:21:26
   const tracer = trace.getTracer('ae-framework-api');
 
   // Register security headers middleware with development config for testing
-  const securityConfig = process.env['NODE_ENV'] === 'test' 
+  const securityConfig = true 
     ? {
         enabled: true,
killedBy: Server instrumentation telemetry Given security headers (non-test) | When uses environment configuration | Then defers to getSecurityConfiguration when not in test mode
statusReason: expected 'DENY' to be undefined

[Killed] BooleanLiteral
src/api/server.ts:23:18
   // Register security headers middleware with development config for testing
   const securityConfig = process.env['NODE_ENV'] === 'test' 
     ? {
-        enabled: true,
+        enabled: false,
         contentSecurityPolicy: {
           enabled: true,
killedBy: Server instrumentation telemetry Given security headers (test) | When returns hardened defaults | Then enforces CSP and strips server signatures in test mode
statusReason: expected undefined to be 'default-src \'self\'; script-src \'se…' // Object.is equality

[Killed] BooleanLiteral
src/api/server.ts:25:20
     ? {
         enabled: true,
         contentSecurityPolicy: {
-          enabled: true,
+          enabled: false,
           directives: "default-src 'self'; script-src 'self'; style-src 'self'; img-src 'self'; test-mode 'enabled';",
         },
killedBy: Server instrumentation telemetry Given security headers (test) | When returns hardened defaults | Then enforces CSP and strips server signatures in test mode
statusReason: expected undefined to be 'default-src \'self\'; script-src \'se…' // Object.is equality

[Killed] BooleanLiteral
src/api/server.ts:29:20
           directives: "default-src 'self'; script-src 'self'; style-src 'self'; img-src 'self'; test-mode 'enabled';",
         },
         permissionsPolicy: {
-          enabled: true,
+          enabled: false,
           directives: 'camera=(), microphone=(), geolocation=(), test-mode=()',
         },
killedBy: Server instrumentation telemetry Given security headers (test) | When returns hardened defaults | Then enforces CSP and strips server signatures in test mode
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] StringLiteral
src/api/server.ts:30:23
         },
         permissionsPolicy: {
           enabled: true,
-          directives: 'camera=(), microphone=(), geolocation=(), test-mode=()',
+          directives: "",
         },
       }
killedBy: Server instrumentation telemetry Given security headers (test) | When returns hardened defaults | Then enforces CSP and strips server signatures in test mode
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
src/api/server.ts:37:54
   await app.register(securityHeadersPlugin, securityConfig);
 
   // Add request tracing hook
-  app.addHook('onRequest', async (request, reply) => {
-    const span = tracer.startSpan(`${request.method} ${request.url}`, {
-      attributes: {
-        [TELEMETRY_ATTRIBUTES.REQUEST_ID]: request.id,
-        [TELEMETRY_ATTRIBUTES.SERVICE_COMPONENT]: 'api-server',
-        [TELEMETRY_ATTRIBUTES.SERVICE_OPERATION]: `${request.method} ${request.url}`,
-        'http.method': request.method,
-        'http.url': request.url,
-        'http.user_agent': request.headers['user-agent'] || 'unknown',
-      },
-    });
-    
-    request.span = span;
-    request.startTime = Date.now();
-    enhancedTelemetry.recordCounter('api.requests.total', 1, {
-      method: request.method,
-      endpoint: request.url,
-    });
-  });
+  app.addHook('onRequest', async (request, reply) => {});
 
   // Add response timing hook
killedBy: Server instrumentation telemetry Given request tracing | When handles successful response | Then records tracing attributes and counters
statusReason: expected "spy" to be called with arguments: [ 'GET /health', ObjectContaining{…} ]

Received: 



Number of calls: 0

[Killed] ObjectLiteral
src/api/server.ts:39:19
   // Add request tracing hook
   app.addHook('onRequest', async (request, reply) => {
     const span = tracer.startSpan(`${request.method} ${request.url}`, {
-      attributes: {
-        [TELEMETRY_ATTRIBUTES.REQUEST_ID]: request.id,
-        [TELEMETRY_ATTRIBUTES.SERVICE_COMPONENT]: 'api-server',
-        [TELEMETRY_ATTRIBUTES.SERVICE_OPERATION]: `${request.method} ${request.url}`,
-        'http.method': request.method,
-        'http.url': request.url,
-        'http.user_agent': request.headers['user-agent'] || 'unknown',
-      },
+      attributes: {},
     });
     
killedBy: Server instrumentation telemetry Given request tracing | When handles successful response | Then records tracing attributes and counters
statusReason: expected "spy" to be called with arguments: [ 'GET /health', ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
    "GET /health",

[Killed] StringLiteral
src/api/server.ts:41:51
     const span = tracer.startSpan(`${request.method} ${request.url}`, {
       attributes: {
         [TELEMETRY_ATTRIBUTES.REQUEST_ID]: request.id,
-        [TELEMETRY_ATTRIBUTES.SERVICE_COMPONENT]: 'api-server',
+        [TELEMETRY_ATTRIBUTES.SERVICE_COMPONENT]: "",
         [TELEMETRY_ATTRIBUTES.SERVICE_OPERATION]: `${request.method} ${request.url}`,
         'http.method': request.method,
killedBy: Server instrumentation telemetry Given request tracing | When handles successful response | Then records tracing attributes and counters
statusReason: expected "spy" to be called with arguments: [ 'GET /health', ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
    "GET /health",

[Killed] ConditionalExpression
src/api/server.ts:45:28
         [TELEMETRY_ATTRIBUTES.SERVICE_OPERATION]: `${request.method} ${request.url}`,
         'http.method': request.method,
         'http.url': request.url,
-        'http.user_agent': request.headers['user-agent'] || 'unknown',
+        'http.user_agent': false,
       },
     });
killedBy: Server instrumentation telemetry Given request tracing | When handles successful response | Then records tracing attributes and counters
statusReason: expected "spy" to be called with arguments: [ 'GET /health', ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
    "GET /health",

[Killed] LogicalOperator
src/api/server.ts:45:28
         [TELEMETRY_ATTRIBUTES.SERVICE_OPERATION]: `${request.method} ${request.url}`,
         'http.method': request.method,
         'http.url': request.url,
-        'http.user_agent': request.headers['user-agent'] || 'unknown',
+        'http.user_agent': request.headers['user-agent'] && 'unknown',
       },
     });
killedBy: Server instrumentation telemetry Given request tracing | When handles successful response | Then records tracing attributes and counters
statusReason: expected "spy" to be called with arguments: [ 'GET /health', ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
    "GET /health",

[Killed] StringLiteral
src/api/server.ts:51:37
     
     request.span = span;
     request.startTime = Date.now();
-    enhancedTelemetry.recordCounter('api.requests.total', 1, {
+    enhancedTelemetry.recordCounter("", 1, {
       method: request.method,
       endpoint: request.url,
killedBy: Server instrumentation telemetry Given request tracing | When handles successful response | Then records tracing attributes and counters
statusReason: expected "spy" to be called with arguments: [ 'api.requests.total', 1, …(1) ]

Received: 

  1st spy call:

  Array [
-   "api.requests.total",

[Killed] ObjectLiteral
src/api/server.ts:51:62
     
     request.span = span;
     request.startTime = Date.now();
-    enhancedTelemetry.recordCounter('api.requests.total', 1, {
-      method: request.method,
-      endpoint: request.url,
-    });
+    enhancedTelemetry.recordCounter('api.requests.total', 1, {});
   });
 
killedBy: Server instrumentation telemetry Given request tracing | When handles successful response | Then records tracing attributes and counters
statusReason: expected "spy" to be called with arguments: [ 'api.requests.total', 1, …(1) ]

Received: 

  1st spy call:

  Array [
    "api.requests.total",

[Killed] StringLiteral
src/api/server.ts:58:15
   });
 
   // Add response timing hook
-  app.addHook('onResponse', async (request, reply) => {
+  app.addHook("", async (request, reply) => {
     const responseMetadata = {
       method: request.method,
killedBy: Server instrumentation telemetry Given createServer | When generates prefixed request ids | Then Fastify genReqId emits req_<timestamp>_<random> format
statusReason: hook not supported!

[Killed] ObjectLiteral
src/api/server.ts:59:30
 
   // Add response timing hook
   app.addHook('onResponse', async (request, reply) => {
-    const responseMetadata = {
-      method: request.method,
-      endpoint: request.url,
-      status_code: reply.statusCode.toString(),
-    };
+    const responseMetadata = {};
 
     const span = request.span;
killedBy: Server instrumentation telemetry Given request tracing | When handles successful response | Then records tracing attributes and counters
statusReason: expected "spy" to be called with arguments: [ 'api.responses.total', 1, …(1) ]

Received: 

  1st spy call:

  Array [
-   "api.responses.total",

[Killed] BooleanLiteral
src/api/server.ts:66:9
     };
 
     const span = request.span;
-    if (!span) {
+    if (span) {
       enhancedTelemetry.recordCounter('api.responses.total', 1, responseMetadata);
       return;
killedBy: Server instrumentation telemetry Given request tracing | When handles successful response | Then records tracing attributes and counters
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/api/server.ts:66:9
     };
 
     const span = request.span;
-    if (!span) {
+    if (true) {
       enhancedTelemetry.recordCounter('api.responses.total', 1, responseMetadata);
       return;
killedBy: Server instrumentation telemetry Given request tracing | When handles successful response | Then records tracing attributes and counters
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ObjectLiteral
src/api/server.ts:71:24
       return;
     }
 
-    span.setAttributes({
-      'http.status_code': reply.statusCode,
-      [TELEMETRY_ATTRIBUTES.DURATION_MS]: Date.now() - (request.startTime || 0),
-    });
+    span.setAttributes({});
     
     if (reply.statusCode >= 400) {
killedBy: Server instrumentation telemetry Given request tracing | When handles successful response | Then records tracing attributes and counters
statusReason: expected {} to deeply equal ObjectContaining{…}

[Killed] ArithmeticOperator
src/api/server.ts:73:43
 
     span.setAttributes({
       'http.status_code': reply.statusCode,
-      [TELEMETRY_ATTRIBUTES.DURATION_MS]: Date.now() - (request.startTime || 0),
+      [TELEMETRY_ATTRIBUTES.DURATION_MS]: Date.now() + (request.startTime || 0),
     });
     
killedBy: Server instrumentation telemetry Given request tracing | When handles successful response | Then records tracing attributes and counters
statusReason: expected 3542417548927 to be less than 10000

[Killed] LogicalOperator
src/api/server.ts:73:57
 
     span.setAttributes({
       'http.status_code': reply.statusCode,
-      [TELEMETRY_ATTRIBUTES.DURATION_MS]: Date.now() - (request.startTime || 0),
+      [TELEMETRY_ATTRIBUTES.DURATION_MS]: Date.now() - (request.startTime && 0),
     });
     
killedBy: Server instrumentation telemetry Given request tracing | When handles successful response | Then records tracing attributes and counters
statusReason: expected 1771208775623 to be less than 10000

[Killed] ConditionalExpression
src/api/server.ts:76:9
       [TELEMETRY_ATTRIBUTES.DURATION_MS]: Date.now() - (request.startTime || 0),
     });
     
-    if (reply.statusCode >= 400) {
+    if (false) {
       span.recordException(new Error(`HTTP ${reply.statusCode}`));
     }
killedBy: Server instrumentation telemetry Given request tracing | When captures error response | Then records exception metadata and error counters
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] EqualityOperator
src/api/server.ts:76:9
       [TELEMETRY_ATTRIBUTES.DURATION_MS]: Date.now() - (request.startTime || 0),
     });
     
-    if (reply.statusCode >= 400) {
+    if (reply.statusCode < 400) {
       span.recordException(new Error(`HTTP ${reply.statusCode}`));
     }
killedBy: Server instrumentation telemetry Given request tracing | When handles successful response | Then records tracing attributes and counters
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      [Error: HTTP 200],

[Killed] StringLiteral
src/api/server.ts:82:37
     
     span.end();
 
-    enhancedTelemetry.recordCounter('api.responses.total', 1, responseMetadata);
+    enhancedTelemetry.recordCounter("", 1, responseMetadata);
   });
 
killedBy: Server instrumentation telemetry Given request tracing | When handles successful response | Then records tracing attributes and counters
statusReason: expected "spy" to be called with arguments: [ 'api.responses.total', 1, …(1) ]

Received: 

  1st spy call:

  Array [
-   "api.responses.total",

[Killed] StringLiteral
src/api/server.ts:93:18
       const healthData = { 
         status: "healthy" as const, 
         timestamp: new Date().toISOString(),
-        service: "ae-framework-api"
+        service: ""
       };
 
killedBy: Health endpoint telemetry integration Given GET /health (valid response) | When returns healthy payload | Then telemetry records success metrics
statusReason: expected '' to be 'ae-framework-api' // Object.is equality

[Killed] BooleanLiteral
src/api/server.ts:107:11
         }
       );
 
-      if (!validation.valid) {
+      if (validation.valid) {
         console.error('Health check response validation failed:', validation.violations);
         // Still return the data in case of validation error to maintain availability
killedBy: Health endpoint telemetry integration Given GET /health (valid response) | When returns healthy payload | Then telemetry records success metrics
statusReason: expected "error" to not be called at all, but actually been called 1 times

Received: 

  1st error call:

    Array [
      "Health check response validation failed:",

[Killed] ConditionalExpression
src/api/server.ts:107:11
         }
       );
 
-      if (!validation.valid) {
+      if (false) {
         console.error('Health check response validation failed:', validation.violations);
         // Still return the data in case of validation error to maintain availability
killedBy: Health endpoint telemetry integration Given GET /health (response validation failure) | When still returns payload | Then logs validation error and drops quality score
statusReason: expected "error" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] StringLiteral
src/api/server.ts:108:23
       );
 
       if (!validation.valid) {
-        console.error('Health check response validation failed:', validation.violations);
+        console.error("", validation.violations);
         // Still return the data in case of validation error to maintain availability
       }
killedBy: Health endpoint telemetry integration Given GET /health (response validation failure) | When still returns payload | Then logs validation error and drops quality score
statusReason: expected "error" to be called with arguments: [ …(2) ]

Received: 

  1st error call:

  Array [
-   "Health check response validation failed:",

[Killed] ObjectLiteral
src/api/server.ts:112:17
         // Still return the data in case of validation error to maintain availability
       }
 
-      timer.end({
-        endpoint: '/health',
-        validation_result: validation.valid ? 'success' : 'failure',
-      });
+      timer.end({});
 
       enhancedTelemetry.recordQualityMetrics({
killedBy: Health endpoint telemetry integration Given GET /health (valid response) | When returns healthy payload | Then telemetry records success metrics
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] ObjectLiteral
src/api/server.ts:117:46
         validation_result: validation.valid ? 'success' : 'failure',
       });
 
-      enhancedTelemetry.recordQualityMetrics({
-        score: validation.valid ? 100 : 0,
-        component: 'health-check',
-        phase: 'runtime',
-      });
+      enhancedTelemetry.recordQualityMetrics({});
 
       return reply.code(200).send(healthData);
killedBy: Health endpoint telemetry integration Given GET /health (valid response) | When returns healthy payload | Then telemetry records success metrics
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] StringLiteral
src/api/server.ts:119:20
 
       enhancedTelemetry.recordQualityMetrics({
         score: validation.valid ? 100 : 0,
-        component: 'health-check',
+        component: "",
         phase: 'runtime',
       });
killedBy: Health endpoint telemetry integration Given GET /health (valid response) | When returns healthy payload | Then telemetry records success metrics
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] StringLiteral
src/api/server.ts:120:16
       enhancedTelemetry.recordQualityMetrics({
         score: validation.valid ? 100 : 0,
         component: 'health-check',
-        phase: 'runtime',
+        phase: "",
       });
 
killedBy: Health endpoint telemetry integration Given GET /health (valid response) | When returns healthy payload | Then telemetry records success metrics
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] BlockStatement
src/api/server.ts:124:21
       });
 
       return reply.code(200).send(healthData);
-    } catch (error) {
-      timer.end({ endpoint: '/health', result: 'error' });
-      const span = req.span;
-      // Stryker disable next-line ConditionalExpression,BooleanLiteral,BlockStatement -- propagate the original error even when the span is missing
-      if (!span) {
-        throw error;
-      }
-      span.recordException(error as Error);
-      throw error;
-    }
+    } catch (error) {}
   });
 
killedBy: Health endpoint telemetry integration Given GET /health (unexpected exception) | When throws during validation | Then timer and span capture health failure
statusReason: expected 200 to be 500 // Object.is equality

[Killed] ObjectLiteral
src/api/server.ts:125:17
 
       return reply.code(200).send(healthData);
     } catch (error) {
-      timer.end({ endpoint: '/health', result: 'error' });
+      timer.end({});
       const span = req.span;
       // Stryker disable next-line ConditionalExpression,BooleanLiteral,BlockStatement -- propagate the original error even when the span is missing
killedBy: Health endpoint telemetry integration Given GET /health (unexpected exception) | When throws during validation | Then timer and span capture health failure
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] StringLiteral
src/api/server.ts:138:49
 
   // Reservations endpoint with full validation
   app.post("/reservations", async (req, reply) => {
-    const timer = enhancedTelemetry.createTimer('api.reservations.duration');
+    const timer = enhancedTelemetry.createTimer("");
     
     try {
killedBy: Reservations API telemetry integration Given POST /reservations (valid payload) | When completes successfully | Then timer/quality metrics are recorded with success flags
statusReason: expected "spy" to be called with arguments: [ 'api.reservations.duration' ]

Received: 

  1st spy call:

  Array [
-   "api.reservations.duration",

[Killed] ObjectLiteral
src/api/server.ts:145:9
       const requestValidation = runtimeGuard.validateRequest(
         CommonSchemas.ReservationRequest,
         req.body,
-        {
-          requestId: req.id,
-          endpoint: 'POST /reservations',
-          operation: 'create_reservation',
-        }
+        {}
       );
 
killedBy: Reservations API telemetry integration Given POST /reservations (valid payload) | When completes successfully | Then timer/quality metrics are recorded with success flags
statusReason: expected "spy" to be called with arguments: [ {}, Anything, ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
    Object {},

[Killed] StringLiteral
src/api/server.ts:148:22
         {
           requestId: req.id,
           endpoint: 'POST /reservations',
-          operation: 'create_reservation',
+          operation: "",
         }
       );
killedBy: Reservations API telemetry integration Given POST /reservations (valid payload) | When completes successfully | Then timer/quality metrics are recorded with success flags
statusReason: expected "spy" to be called with arguments: [ {}, Anything, ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
    Object {},

[Killed] BlockStatement
src/api/server.ts:152:37
         }
       );
 
-      if (!requestValidation.valid) {
-        const violation = requestValidation.violations?.[0];
-        timer.end({ 
-          endpoint: '/reservations', 
-          result: 'validation_error',
-          violation_type: violation?.type || 'unknown',
-        });
-        
-        return reply.code(400).send({
-          error: "VALIDATION_ERROR",
-          message: "Request payload validation failed",
-          details: violation?.details || 'Validation failed',
-          violation_id: violation?.id || 'unknown',
-        });
-      }
+      if (!requestValidation.valid) {}
 
       const { orderId, itemId, quantity } = requestValidation.data!;
killedBy: Reservations API telemetry integration Given POST /reservations (invalid payload) | When is rejected by runtime guard validation | Then violations are returned and telemetry marks validation_error
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/api/server.ts:152:11
         }
       );
 
-      if (!requestValidation.valid) {
+      if (true) {
         const violation = requestValidation.violations?.[0];
         timer.end({ 
killedBy: Reservations API telemetry integration Given POST /reservations (valid payload) | When completes successfully | Then timer/quality metrics are recorded with success flags
statusReason: expected 400 to be 201 // Object.is equality

[Killed] OptionalChaining
src/api/server.ts:153:27
       );
 
       if (!requestValidation.valid) {
-        const violation = requestValidation.violations?.[0];
+        const violation = requestValidation.violations[0];
         timer.end({ 
           endpoint: '/reservations', 
killedBy: Reservations API telemetry integration Given POST /reservations (invalid payload) | When is rejected by runtime guard validation | Then violations are returned and telemetry marks validation_error
statusReason: expected 500 to be 400 // Object.is equality

[Killed] StringLiteral
src/api/server.ts:155:21
       if (!requestValidation.valid) {
         const violation = requestValidation.violations?.[0];
         timer.end({ 
-          endpoint: '/reservations', 
+          endpoint: "", 
           result: 'validation_error',
           violation_type: violation?.type || 'unknown',
killedBy: Reservations API telemetry integration Given POST /reservations (invalid payload) | When is rejected by runtime guard validation | Then violations are returned and telemetry marks validation_error
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] LogicalOperator
src/api/server.ts:157:27
         timer.end({ 
           endpoint: '/reservations', 
           result: 'validation_error',
-          violation_type: violation?.type || 'unknown',
+          violation_type: violation?.type && 'unknown',
         });
         
killedBy: Reservations API telemetry integration Given POST /reservations (invalid payload) | When is rejected by runtime guard validation | Then violations are returned and telemetry marks validation_error
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] ConditionalExpression
src/api/server.ts:157:27
         timer.end({ 
           endpoint: '/reservations', 
           result: 'validation_error',
-          violation_type: violation?.type || 'unknown',
+          violation_type: true,
         });
         
killedBy: Reservations API telemetry integration Given POST /reservations (invalid payload) | When is rejected by runtime guard validation | Then violations are returned and telemetry marks validation_error
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] StringLiteral
src/api/server.ts:161:18
         });
         
         return reply.code(400).send({
-          error: "VALIDATION_ERROR",
+          error: "",
           message: "Request payload validation failed",
           details: violation?.details || 'Validation failed',
killedBy: Reservations API telemetry integration Given POST /reservations (invalid payload) | When is rejected by runtime guard validation | Then violations are returned and telemetry marks validation_error
statusReason: expected { error: '', …(3) } to deeply equal { error: 'VALIDATION_ERROR', …(3) }

[Killed] StringLiteral
src/api/server.ts:162:20
         
         return reply.code(400).send({
           error: "VALIDATION_ERROR",
-          message: "Request payload validation failed",
+          message: "",
           details: violation?.details || 'Validation failed',
           violation_id: violation?.id || 'unknown',
killedBy: Reservations API telemetry integration Given POST /reservations (invalid payload) | When is rejected by runtime guard validation | Then violations are returned and telemetry marks validation_error
statusReason: expected { error: 'VALIDATION_ERROR', …(3) } to deeply equal { error: 'VALIDATION_ERROR', …(3) }
