[Killed] OptionalChaining
src/api/server.ts:163:20
         return reply.code(400).send({
           error: "VALIDATION_ERROR",
           message: "Request payload validation failed",
-          details: violation?.details || 'Validation failed',
+          details: violation.details || 'Validation failed',
           violation_id: violation?.id || 'unknown',
         });
killedBy: Reservations API telemetry integration Given POST /reservations (invalid payload) | When is rejected by runtime guard validation | Then violations are returned and telemetry marks validation_error
statusReason: expected { statusCode: 400, …(2) } to deeply equal { error: 'VALIDATION_ERROR', …(3) }

[Killed] ConditionalExpression
src/api/server.ts:163:20
         return reply.code(400).send({
           error: "VALIDATION_ERROR",
           message: "Request payload validation failed",
-          details: violation?.details || 'Validation failed',
+          details: false,
           violation_id: violation?.id || 'unknown',
         });
killedBy: Reservations API telemetry integration Given POST /reservations (invalid payload) | When is rejected by runtime guard validation | Then violations are returned and telemetry marks validation_error
statusReason: expected { error: 'VALIDATION_ERROR', …(3) } to deeply equal { error: 'VALIDATION_ERROR', …(3) }

[Killed] ConditionalExpression
src/api/server.ts:164:25
           error: "VALIDATION_ERROR",
           message: "Request payload validation failed",
           details: violation?.details || 'Validation failed',
-          violation_id: violation?.id || 'unknown',
+          violation_id: false,
         });
       }
killedBy: Reservations API telemetry integration Given POST /reservations (invalid payload) | When is rejected by runtime guard validation | Then violations are returned and telemetry marks validation_error
statusReason: expected { error: 'VALIDATION_ERROR', …(3) } to deeply equal { error: 'VALIDATION_ERROR', …(3) }

[Killed] OptionalChaining
src/api/server.ts:164:25
           error: "VALIDATION_ERROR",
           message: "Request payload validation failed",
           details: violation?.details || 'Validation failed',
-          violation_id: violation?.id || 'unknown',
+          violation_id: violation.id || 'unknown',
         });
       }
killedBy: Reservations API telemetry integration Given POST /reservations (invalid payload) | When is rejected by runtime guard validation | Then violations are returned and telemetry marks validation_error
statusReason: expected { statusCode: 400, …(2) } to deeply equal { error: 'VALIDATION_ERROR', …(3) }

[Killed] BlockStatement
src/api/server.ts:171:27
       const { orderId, itemId, quantity } = requestValidation.data!;
 
       // Business rule validation
-      if (quantity > 100) {
-        runtimeGuard.recordBusinessRuleViolation(
-          'max_quantity_limit',
-          `Quantity ${quantity} exceeds maximum allowed (100)`,
-          ViolationSeverity.MEDIUM,
-          { orderId, itemId, quantity }
-        );
-        
-        timer.end({ endpoint: '/reservations', result: 'business_rule_violation' });
-        
-        return reply.code(400).send({
-          error: "BUSINESS_RULE_VIOLATION",
-          message: "Quantity exceeds maximum allowed limit of 100",
-        });
-      }
+      if (quantity > 100) {}
 
       // TODO: delegate to service layer (inventory checks, idempotent handling, transactions)
killedBy: Reservations API telemetry integration Given POST /reservations (quantity over 100) | When triggers business rule guard | Then business rule violation is recorded and success metrics are not emitted
statusReason: expected 201 to be 400 // Object.is equality

[Killed] EqualityOperator
src/api/server.ts:171:11
       const { orderId, itemId, quantity } = requestValidation.data!;
 
       // Business rule validation
-      if (quantity > 100) {
+      if (quantity <= 100) {
         runtimeGuard.recordBusinessRuleViolation(
           'max_quantity_limit',
killedBy: Reservations API telemetry integration Given POST /reservations (valid payload) | When completes successfully | Then timer/quality metrics are recorded with success flags
statusReason: expected 400 to be 201 // Object.is equality

[Killed] ObjectLiteral
src/api/server.ts:179:19
           { orderId, itemId, quantity }
         );
         
-        timer.end({ endpoint: '/reservations', result: 'business_rule_violation' });
+        timer.end({});
         
         return reply.code(400).send({
killedBy: Reservations API telemetry integration Given POST /reservations (quantity over 100) | When triggers business rule guard | Then business rule violation is recorded and success metrics are not emitted
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] StringLiteral
src/api/server.ts:182:18
         timer.end({ endpoint: '/reservations', result: 'business_rule_violation' });
         
         return reply.code(400).send({
-          error: "BUSINESS_RULE_VIOLATION",
+          error: "",
           message: "Quantity exceeds maximum allowed limit of 100",
         });
killedBy: Reservations API telemetry integration Given POST /reservations (quantity over 100) | When triggers business rule guard | Then business rule violation is recorded and success metrics are not emitted
statusReason: expected { error: '', …(1) } to deeply equal { …(2) }

[Killed] BooleanLiteral
src/api/server.ts:188:34
       }
 
       // TODO: delegate to service layer (inventory checks, idempotent handling, transactions)
-      const responseData = { ok: true };
+      const responseData = { ok: false };
 
       // Validate response
killedBy: Reservations API telemetry integration Given POST /reservations (valid payload) | When completes successfully | Then timer/quality metrics are recorded with success flags
statusReason: expected { ok: false } to deeply equal { ok: true }

[Killed] ConditionalExpression
src/api/server.ts:201:11
         }
       );
 
-      if (!responseValidation.valid) {
+      if (false) {
         console.error('Reservation response validation failed:', responseValidation.violations);
       }
killedBy: Reservations API telemetry integration Given POST /reservations (response validation failure) | When keeps responding but flags quality metrics | Then response validation failure is logged and scored 
statusReason: expected "error" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/api/server.ts:201:38
         }
       );
 
-      if (!responseValidation.valid) {
-        console.error('Reservation response validation failed:', responseValidation.violations);
-      }
+      if (!responseValidation.valid) {}
 
       timer.end({
killedBy: Reservations API telemetry integration Given POST /reservations (response validation failure) | When keeps responding but flags quality metrics | Then response validation failure is logged and scored 
statusReason: expected "error" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] StringLiteral
src/api/server.ts:202:23
       );
 
       if (!responseValidation.valid) {
-        console.error('Reservation response validation failed:', responseValidation.violations);
+        console.error("", responseValidation.violations);
       }
 
killedBy: Reservations API telemetry integration Given POST /reservations (response validation failure) | When keeps responding but flags quality metrics | Then response validation failure is logged and scored 
statusReason: expected "error" to be called with arguments: [ …(2) ]

Received: 

  1st error call:

  Array [
-   "Reservation response validation failed:",

[Killed] BlockStatement
src/api/server.ts:218:21
       });
 
       return reply.code(201).send(responseData);
-    } catch (error) {
-      timer.end({ endpoint: '/reservations', result: 'error' });
-      const span = req.span;
-      // Stryker disable next-line ConditionalExpression,BooleanLiteral,BlockStatement -- propagate the original error even when the span is missing
-      if (!span) {
-        throw error;
-      }
-      span.recordException(error as Error);
-      throw error;
-    }
+    } catch (error) {}
   });
 
killedBy: Reservations API telemetry integration Given POST /reservations (unexpected exception) | When throws inside handler | Then timer and span record exceptions before bubbling up
statusReason: expected 200 to be 500 // Object.is equality

[Killed] ObjectLiteral
src/api/server.ts:219:17
 
       return reply.code(201).send(responseData);
     } catch (error) {
-      timer.end({ endpoint: '/reservations', result: 'error' });
+      timer.end({});
       const span = req.span;
       // Stryker disable next-line ConditionalExpression,BooleanLiteral,BlockStatement -- propagate the original error even when the span is missing
killedBy: Reservations API telemetry integration Given POST /reservations (unexpected exception) | When throws inside handler | Then timer and span record exceptions before bubbling up
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] BlockStatement
src/api/server.ts:231:61
   });
 
   // Runtime guard statistics endpoint
-  app.get("/api/runtime-guard/stats", async (req, reply) => {
-    try {
-      const stats = runtimeGuard.getViolationStats();
-      return reply.code(200).send({
-        violations: stats,
-        uptime: process.uptime(),
-        timestamp: new Date().toISOString(),
-      });
-    } catch (error) {
-      const span = req.span;
-      // Stryker disable next-line ConditionalExpression,BooleanLiteral,BlockStatement -- propagate the original error even when the span is missing
-      if (!span) {
-        throw error;
-      }
-      span.recordException(error as Error);
-      throw error;
-    }
-  });
+  app.get("/api/runtime-guard/stats", async (req, reply) => {});
 
   // Register health check endpoints for Docker/Kubernetes
killedBy: Reservations API telemetry integration Given GET /api/runtime-guard/stats | When returns runtime guard metrics | Then payload includes aggregated violation stats
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/api/server.ts:232:9
 
   // Runtime guard statistics endpoint
   app.get("/api/runtime-guard/stats", async (req, reply) => {
-    try {
-      const stats = runtimeGuard.getViolationStats();
-      return reply.code(200).send({
-        violations: stats,
-        uptime: process.uptime(),
-        timestamp: new Date().toISOString(),
-      });
-    } catch (error) {
+    try {} catch (error) {
       const span = req.span;
       // Stryker disable next-line ConditionalExpression,BooleanLiteral,BlockStatement -- propagate the original error even when the span is missing
killedBy: Reservations API telemetry integration Given GET /api/runtime-guard/stats | When returns runtime guard metrics | Then payload includes aggregated violation stats
statusReason: Unexpected end of JSON input

[Killed] ObjectLiteral
src/api/server.ts:234:35
   app.get("/api/runtime-guard/stats", async (req, reply) => {
     try {
       const stats = runtimeGuard.getViolationStats();
-      return reply.code(200).send({
-        violations: stats,
-        uptime: process.uptime(),
-        timestamp: new Date().toISOString(),
-      });
+      return reply.code(200).send({});
     } catch (error) {
       const span = req.span;
killedBy: Reservations API telemetry integration Given GET /api/runtime-guard/stats | When returns runtime guard metrics | Then payload includes aggregated violation stats
statusReason: expected undefined to deeply equal { data_validation: 2, …(1) }

[Killed] BlockStatement
src/api/server.ts:239:21
         uptime: process.uptime(),
         timestamp: new Date().toISOString(),
       });
-    } catch (error) {
-      const span = req.span;
-      // Stryker disable next-line ConditionalExpression,BooleanLiteral,BlockStatement -- propagate the original error even when the span is missing
-      if (!span) {
-        throw error;
-      }
-      span.recordException(error as Error);
-      throw error;
-    }
+    } catch (error) {}
   });
 
killedBy: Reservations API telemetry integration Given GET /api/runtime-guard/stats (runtime failure) | When throws while collecting stats | Then span records exception before error propagates
statusReason: expected 200 to be 500 // Object.is equality

[Killed] BlockStatement
src/api/server.ts:257:43
 }
 
 // Export a function to get a configured server instance for backward compatibility
-export default async function getServer() {
-  return createServer();
-}
+export default async function getServer() {}
 
killedBy: getServer default export returns a configured Fastify instance
statusReason: expected undefined to be truthy
